benchmark/report/rps/full/20260804_180000/raw/002_health_c10_r1.txt
Running 20s test @ http://127.0.0.1:32773/api/health
  8 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.07ms  473.76us  12.31ms   77.58%
    Req/Sec     0.93k   166.82     1.59k    84.00%
  Latency Distribution
     50%    0.99ms
     75%    1.28ms
     90%    1.62ms
     99%    2.63ms
  147533 requests in 20.02s, 65.99MB read
Requests/sec:   7367.48
Transfer/sec:      3.30MB
HPS_WRK_REQUESTS 147533
HPS_WRK_STATUS_ERRORS 0
HPS_SOCKET_CONNECT 0
HPS_SOCKET_READ 0
HPS_SOCKET_WRITE 0
HPS_SOCKET_TIMEOUT 0
HPS_STATUS_TOTAL 147533
HPS_STATUS_2XX 147533
HPS_STATUS_NON_2XX 0
HPS_STATUS_UNEXPECTED 0
HPS_STATUS_CODES 200=147533